[
  {
    "dependencies": [],
    "description": "Base class for all tools",
    "name": "contacts_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    Search your conversation history and long-term memories using hybrid vector + BM25 search.\n    Default searches collapsed segment summaries that synthesize entire conversations.\n    Also supports searching your long-term memories with semantic similarity and keyword matching.\n    Returns results with confidence scores. For conversations, get time boundaries to drill into details.\n    \n\n    This tool has three primary operations:\n\n    1. search: Find information in segment summaries (default), messages, or memories\n       - Required: query (what to search for)\n       - Optional: search_mode (\"summaries\", \"messages\", \"memories\"), entities, max_results, page\n       - For search_mode=\"messages\": REQUIRES start_time AND end_time parameters\n       - For search_mode=\"memories\": Searches long-term memories with hybrid vector+BM25\n       - Returns: Segment summaries, message previews, or memories with confidence scores\n\n    2. search_within_segment: Search messages within a specific segment\n       - Required: segment_id (8-char ID from summary search)\n       - Optional: query (to filter within segment), max_results\n       - Returns: All messages from that segment, optionally filtered\n\n    3. expand_message: Get full content of a specific message with context\n       - Required: message_id (first 8 characters of UUID)\n       - Optional: direction (\"before\", \"after\", \"both\"), context_count\n       - Returns: Full message content plus surrounding messages\n\n    SEARCH STRATEGY (Summary Mode - Default):\n    - Hybrid search combining vector similarity and BM25 text ranking\n    - Vector search uses 384-dim embeddings for semantic matching\n    - BM25 search on summary text for keyword precision\n    - Combined score: weighted combination of vector similarity and text relevance (configurable)\n    - Returns collapsed segment summaries with full conversation synthesis\n    - Supports temporal direction with reference_time:\n      * before: Find segments earlier than reference_time\n      * after: Find segments later than reference_time\n      * around: Find segments within ±7 days of reference_time\n\n    SEARCH STRATEGY (Message Mode - Requires Timescope):\n    - Direct BM25 search on message content\n    - MUST provide start_time and end_time to bound the search\n    - Use this after finding relevant segments for detailed quotes\n\n    SEARCH STRATEGY (Memory Mode):\n    - Hybrid search combining vector similarity (AllMiniLM 384d) and BM25 text ranking\n    - Searches your long-term memories (extracted insights, facts, preferences)\n    - Returns memories with importance scores, timestamps, and link counts\n    - No time boundaries required - searches all memories\n    - Supports pagination for browsing through results\n\n    PROGRESSIVE DISCLOSURE:\n    - Start with segment summaries (dense, synthesized information)\n    - Each summary includes time boundaries and confidence score\n    - Use search_within_segment to drill into specific segments\n    - Use expand_message for full context around specific messages\n\n    CONFIDENCE LEVELS:\n    - High (≥0.70): Summaries contain clear matches to your query\n    - Medium (0.40-0.69): Relevant segments found, may need to search within\n    - Low (<0.40): Consider refining query or entities\n\n    The calling LLM should:\n    - Always start with summary search (most efficient)\n    - Extract entities/proper nouns before searching\n    - Use segment time boundaries to search for specific details\n    - Only use message mode when you have specific timescopes\n    ",
    "name": "continuumsearch_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    WHEN TO USE THIS TOOL:\n\n    Use getcontext_tool proactively whenever the conversation implies there might be relevant\n    context beyond what's currently in working memory. Since the tool returns instantly and\n    searches in the background, there's minimal cost to invoking it.\n\n    Invoke freely when:\n    - User references something from the past (\"remember when...\", \"like we discussed...\")\n    - User asks about topics that might have prior context\n    - Conversation shifts to a new topic where historical context could be relevant\n    - You're unsure if you have complete information on a topic\n    - User asks questions that might benefit from web information\n    - You want to proactively gather context while continuing the conversation\n\n    Examples of queries:\n    - \"What have we discussed about machine learning projects?\"\n    - \"Taylor's work schedule and preferences\"\n    - \"Everything about the home automation system\"\n    - \"API redesign decisions\"\n    - \"Recent news about quantum computing\" (will search web)\n    - Simple topic queries work fine - agent handles complexity internally\n\n    DO NOT USE when:\n    - You need synchronous results immediately (use continuumsearch_tool instead)\n    - Searching within a specific known time range (use continuumsearch_tool with timescope)\n    - Information is already in current working memory\n\n    HOW IT WORKS:\n\n    The tool launches an autonomous search agent that runs in the background:\n\n    1. **Immediate Return**: Tool returns instantly with a searching indicator in the context window\n    2. **Autonomous Planning**: Agent decomposes query into search strategy\n    3. **Iterative Search**: Agent searches conversations, memories, web as needed\n    4. **Smart Completion**: Agent determines when sufficient context is gathered\n    5. **Automatic Summary**: Results appear in context window with findings and sources\n\n    Search runs for up to 5 minutes. Agent makes intelligent decisions about what sources\n    to search and when to stop based on findings.\n\n    SEARCH MODES:\n    - standard (default): Stops when key information is found (faster, focused)\n    - deep: Exhaustive search across all sources (comprehensive, takes longer)\n\n    SEARCH SCOPE:\n    By default searches all available sources. Can be limited:\n    - conversation: User's conversation history\n    - memory: Long-term memories\n    - web: Current web information\n\n    RESULTS:\n    - Appear asynchronously in a context window in working memory\n    - Show pending status (🔍) while searching\n    - Display summary with key findings, confidence scores, and sources when complete\n    - Show timeout/failure messages if search encounters issues\n    ",
    "name": "getcontext_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    Dynamically load and unload tools to manage context efficiently. Check working memory for available tools.\n    OPERATIONS:\n\n    - load: Load one or more tools for use\n      Parameters:\n        mode: \"load\"\n        query: Comma-separated tool names (e.g., \"weather_tool\" or \"weather_tool,calendar_tool\")\n\n    - unload: Remove tools from context\n      Parameters:\n        mode: \"unload\"\n        query: Comma-separated tool names to unload\n\n    - fallback: Emergency mode - load ALL tools for one turn\n      Parameters:\n        mode: \"fallback\"\n        query: (ignored for this mode)\n\n    USAGE NOTES:\n    - Check working memory for list of available tools and their descriptions\n    - Tools remain loaded until explicitly unloaded or auto-cleaned after 5 idle turns\n    - Essential tools (webaccess_tool, reminder_tool) are always loaded\n    - Fallback mode auto-unloads all tools after one turn\n    ",
    "name": "invokeother_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "Base class for all tools",
    "name": "kasa_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "Track time spent on labelled work sessions. Supports punch in/out, pause, and resume.\n\nOperations:\n- punch_in: start a new session with a label (optional notes and start_time).\n- pause: pause a running session.\n- resume: resume a paused session.\n- punch_out: complete a session.\n- status: inspect active/paused/completed sessions.\nTimes accept ISO strings or offsets like '-5m', '15m ago', '+1h'.",
    "name": "punchclock_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    Manages scheduled reminders with contact information integration. Use this tool when the user\n    wants to create, view, or manage reminders about tasks, follow-ups, or appointments. You can\n    also create internal reminders for yourself using category='internal' to track things you need\n    to remember or follow up on later.\n\n    ⏰ IMPORTANT: If a reminder is due/overdue you MUST notify the user in-continuum even if y'all are talking about an unrelated topic. The user CANNOT see the reminders unless you notify them verbally. You MUST interrupt the continuum with an aside and keep it front-of-mind until the user either completes, cancels, or reschedules the reminder. ⏰ \n    \n    IMPORTANT: This tool requires parameters to be passed as a JSON string in the \"kwargs\" field.\n    The tool supports these operations:\n    \n    1. add_reminder: Create a new reminder with a date, description, and optional contact info.\n       - Required: title (brief description), date (when to be reminded)\n       - Optional: description (details), contact_name (will link to existing contact by UUID),\n         category ('user' or 'internal', default 'user')\n       - Use category='internal' for your own reminders that shouldn't be shown to the user\n       - If a contact name is provided, attempts to find matching contact and link by UUID\n       - Returns the created reminder with a unique identifier\n    \n    2. get_reminders: Retrieve reminders for a specific date range.\n       - Required: date_type (\"today\", \"tomorrow\", \"upcoming\", \"past\", \"all\", \"date\" or \"range\")\n       - Optional: category ('user', 'internal', or 'all', default 'user')\n       - If date_type is \"date\", requires specific_date parameter\n       - If date_type is \"range\", requires start_date and end_date parameters\n       - Returns list of reminders matching the criteria with current contact information\n    \n    3. mark_completed: Mark a reminder as completed.\n       - Required: reminder_id (the ID of the reminder to mark as completed)\n       - Returns the updated reminder\n       \n    4. update_reminder: Update an existing reminder's details.\n       - Required: reminder_id (the ID of the reminder to update)\n       - Optional: Any fields to update (title, description, date, contact_name to link)\n       - Returns the updated reminder\n       \n    5. delete_reminder: Remove a reminder.\n       - Required: reminder_id (the ID of the reminder to delete)\n       - Returns confirmation of deletion\n       \n    This tool automatically integrates with the user's contacts when contact names are provided,\n    linking to existing contacts by UUID. Contact details are fetched dynamically when displaying\n    reminders to ensure current information is always shown.\n    ",
    "name": "reminder_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    Retrieves weather forecast data and calculates heat stress indices for specified locations.\n    Use this tool to get weather forecasts, heat stress information, and related data for planning\n    field work activities based on expected weather conditions.\n    \n    OPERATIONS:\n    - get_forecast: Retrieves weather forecast data for a specific location\n      Parameters:\n        latitude (required): Latitude of the location (-90 to 90)\n        longitude (required): Longitude of the location (-180 to 180)\n        forecast_type (optional): Type of forecast to retrieve (hourly, daily). Default is hourly.\n        forecast_days (optional): Number of days to include in the forecast (1-16). Default is 7 days.\n        date (optional): Specific date for forecast in ISO format (YYYY-MM-DD). If not provided, returns forecast from current date.\n        parameters (optional): Specific parameters to retrieve, comma-separated or as a list. If not provided, returns all available parameters.\n        \n    - get_heat_stress: Retrieves weather data and calculates heat stress indices for a specific location\n      Parameters:\n        latitude (required): Latitude of the location (-90 to 90)\n        longitude (required): Longitude of the location (-180 to 180)\n        forecast_type (optional): Type of forecast to retrieve (hourly, daily). Default is hourly.\n        forecast_days (optional): Number of days to include in the forecast (1-16). Default is 7 days.\n        date (optional): Specific date for forecast in ISO format (YYYY-MM-DD). If not provided, returns forecast from current date.\n        parameters (optional): Additional specific parameters to retrieve beyond those needed for heat stress calculation.\n    \n    RESPONSE FORMAT:\n    - For get_forecast operations: Weather data including requested parameters\n    - For get_heat_stress operations: Weather data plus WBGT values and heat stress risk levels\n    \n    LIMITATIONS:\n    - Forecasts are limited to 16 days into the future (default is 7 days)\n    - Historical data is not available through this tool\n    - Heat stress calculations are approximations and should be used as guidance, not as definitive safety indicators\n    - Some parameters may not be available for all locations or time periods\n    ",
    "name": "weather_tool",
    "parameters": {},
    "required_parameters": []
  },
  {
    "dependencies": [],
    "description": "\n    Provides comprehensive web access capabilities including HTTP requests, web searches, and webpage content extraction.\n    This integrated tool allows you to interact with web resources through direct HTTP requests to APIs,\n    perform web searches for up-to-date information, and extract clean content from webpages.\n    Use this tool whenever you need to access, search, or extract information from the web.\n    \n    This tool combines three web access capabilities:\n    \n    1. HTTP REQUEST FUNCTIONALITY:\n       Makes HTTP requests to external APIs and web services with various methods, parameters, and headers.\n       \n       Operations:\n       - GET: Retrieve data from a specified URL\n         Parameters:\n           url (required): The URL to send the request to\n           params (optional): Query parameters as a dictionary\n           headers (optional): HTTP headers as a dictionary\n           timeout (optional, default=30): Request timeout in seconds\n           response_format (optional, default=\"json\"): Format to return the response in (\"json\", \"text\", or \"full\")\n    \n       - POST: Send data to a specified URL\n         Parameters:\n           url (required): The URL to send the request to\n           data (optional): Form data to send (as a string or dictionary)\n           json (optional): JSON data to send (as a dictionary)\n           params (optional): Query parameters as a dictionary\n           headers (optional): HTTP headers as a dictionary\n           timeout (optional, default=30): Request timeout in seconds\n           response_format (optional, default=\"json\"): Format to return the response in (\"json\", \"text\", or \"full\")\n    \n       - PUT: Update data at a specified URL (parameters same as POST)\n    \n       - DELETE: Delete data at a specified URL (parameters similar to GET)\n    \n    2. WEB SEARCH FUNCTIONALITY:\n       Performs web searches using Kagi search API to find up-to-date information from the internet.\n       \n       Operations:\n       - Search the web for information\n         Parameters:\n           query (required): The search query to send to Kagi search\n           max_results (optional, default=3): Maximum number of results to return\n           allowed_domains (optional): List of domains to include in results\n           blocked_domains (optional): List of domains to exclude from results\n    \n    3. WEBPAGE EXTRACTION FUNCTIONALITY:\n       Extracts content from webpages using Claude's understanding of web content.\n       \n       Operations:\n       - Extract content from a webpage at a given URL\n         Parameters:\n           url (required): The URL of the webpage to extract content from\n           extraction_prompt (optional): Custom prompt to guide the extraction (default focuses on main content)\n           format (optional, default=\"text\"): Output format - \"text\", \"markdown\", or \"html\"\n           include_metadata (optional, default=False): Whether to include page metadata in the output\n           timeout (optional, default=30): Request timeout in seconds\n    \n    USAGE NOTES:\n    - Use http_request for direct API calls when you know the specific endpoint and parameters\n    - Use web_search when you need to find information but don't have a specific URL\n    - Use webpage_extract when you have a URL but need to get clean, readable content from it\n    - These capabilities can be used together: search for content, then extract from the best result URLs\n    \n    LIMITATIONS:\n    - Cannot make requests to internal network addresses (security restriction)\n    - Search quality depends on query formulation\n    - Very large pages may exceed processing limits\n    - Some websites may block automated access\n    - JavaScript-rendered content may not be fully captured\n    ",
    "name": "webaccess_tool",
    "parameters": {},
    "required_parameters": []
  }
]